Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# %lld 条本地记忆
source: %lld local memories
ja: %lld件のローカルメモリ
ko: 로컬 메모리 %lld개
ru: %lld локальных воспоминаний
zh_hans: %lld 条本地记忆
zh_hant: %lld 條本機記憶

# %lld 次
source: %lld times
ja: %lld 回
ko: %lld회
ru: Количество: %lld
zh_hans: %lld 次
zh_hant: %lld 次

# %lld 源
source: %lld sources
ja: %lld 件のソース
ko: 소스 %lld개
ru: Источников: %lld
zh_hans: %lld 源
zh_hant: %lld 個來源

# %lld 章
source: %lld chapters
ja: %lld 章
ko: %lld장
ru: Глав: %lld
zh_hans: %lld 章
zh_hant: %lld 章

# %lld 章（待同步计章）
source: %lld chapters (pending sync count)
ja: %lld章（同期で計上待ち）
ko: %lld장(장 수 동기화 대기)
ru: %lld гл. (ожидают синхронизации)
zh_hans: %lld 章（待同步计章）
zh_hant: %lld 章（待同步計數）

# 1 小时
source: 1 hour
ja: 1時間
ko: 1시간
ru: 1 час
zh_hans: 1 小时
zh_hant: 1 小時

# 1. 打开下方页面并用 ChatGPT 登录 2. 输入上面的登录码 3. 完成后这里会自动登录
source: 1. Open the page below and sign in with ChatGPT 2. Enter the login code above 3. Once complete, you'll be signed in here automatically
ja: 1. 下のページを開き、ChatGPT にログイン 2. 上のログインコードを入力 3. 完了すると、ここで自動的にログインします
ko: 1. 아래 페이지를 열고 ChatGPT로 로그인하세요 2. 위의 로그인 코드를 입력하세요 3. 완료되면 여기에서 자동으로 로그인됩니다
ru: 1. Откройте страницу ниже и войдите в ChatGPT 2. Введите код входа выше 3. После завершения вход будет выполнен автоматически
zh_hans: 1. 打开下方页面并用 ChatGPT 登录 2. 输入上面的登录码 3. 完成后这里会自动登录
zh_hant: 1. 開啟下方頁面並使用 ChatGPT 登入 2. 輸入上方的登入碼 3. 完成後此處會自動登入

# @%@ · 角色详情
source: @%@ · Role details
ja: @%@ · 役割の詳細
ko: @%@ · 역할 세부 정보
ru: @%@ · Подробнее о роли
zh_hans: @%@ · 角色详情
zh_hant: @%@ · 角色詳情

# AI · 英文源
source: AI · English Sources
ja: AI · 英語ソース
ko: AI · 영어 출처
ru: AI · Источники на английском
zh_hans: AI · 英文源
zh_hant: AI · 英文來源

# AI 只会生成建议，确认后才写入项目设定。
source: AI only generates suggestions; changes are written to the project settings after you confirm.
ja: AI は提案のみを生成し、確認後にプロジェクト設定へ書き込みます。
ko: AI는 제안만 생성하며, 확인 후에 프로젝트 설정에 반영됩니다.
ru: AI только формирует предложения; после подтверждения они будут записаны в настройки проекта.
zh_hans: AI 只会生成建议，确认后才写入项目设定。
zh_hant: AI 只會產生建議，確認後才會寫入專案設定。

# AI 生图
source: AI Image Generation
ja: AI画像生成
ko: AI 이미지 생성
ru: Генерация изображений AI
zh_hans: AI 生图
zh_hant: AI 生圖

# AI 生成
source: AI-generated
ja: AI生成
ko: AI 생성
ru: Генерация AI
zh_hans: AI 生成
zh_hant: AI 產生

# AI 生成草稿
source: AI-generated draft
ja: AI生成の下書き
ko: AI 생성 초안
ru: Черновик, созданный AI
zh_hans: AI 生成草稿
zh_hant: AI 產生草稿

# AI 草稿
source: AI draft
ja: AI下書き
ko: AI 초안
ru: Черновик AI
zh_hans: AI 草稿
zh_hant: AI 草稿

# API Key 无效或没有权限。请回到「服务商」确认 Key 是否填写正确，并确认它有访问当前服务商的权限。
source: Invalid API Key or insufficient permissions. Return to “Provider” to confirm the Key is entered correctly and has access to the current provider.
ja: API Key が無効、または権限がありません。「サービスプロバイダー」に戻り、Key が正しく入力されていることと、現在のサービスプロバイダーへのアクセス権があることを確認してください。
ko: API Key가 유효하지 않거나 권한이 없습니다. 「서비스 제공자」로 돌아가 API Key가 올바르게 입력되었는지, 현재 서비스 제공자에 액세스할 권한이 있는지 확인하세요.
ru: API Key недействителен или нет прав доступа. Вернитесь в «Провайдеры», проверьте правильность Key и наличие доступа к текущему провайдеру.
zh_hans: API Key 无效或没有权限。请回到「服务商」确认 Key 是否填写正确，并确认它有访问当前服务商的权限。
zh_hant: API Key 無效或沒有權限。請回到「服務提供者」確認 Key 是否正確填寫，並確認它具備存取目前服務提供者的權限。

# API 地址无效
source: Invalid API URL
ja: API アドレスが無効です
ko: API 주소가 유효하지 않습니다.
ru: Недействительный адрес API
zh_hans: API 地址无效
zh_hant: API 位址無效

# Agent iSH 工具
source: Agent iSH tool
ja: Agent iSHツール
ko: Agent iSH 도구
ru: Инструменты Agent iSH
zh_hans: Agent iSH 工具
zh_hant: Agent iSH 工具

# Agent 在对话中通过 recipe_import 导入候选 Recipe；批准后从下一模型轮生效。
source: Agent imports a candidate Recipe via recipe_import in the conversation; it takes effect from the next model turn after approval.
ja: Agent は会話中に recipe_import で候補の Recipe をインポートします。承認後、次のモデルラウンドから有効になります。
ko: Agent가 대화에서 recipe_import를 통해 후보 Recipe를 가져옵니다. 승인하면 다음 모델 라운드부터 적용됩니다.
ru: Agent импортирует предложенный Recipe через recipe_import в диалоге; после одобрения он вступит в силу со следующего раунда модели.
zh_hans: Agent 在对话中通过 recipe_import 导入候选 Recipe；批准后从下一模型轮生效。
zh_hant: Agent 會在對話中透過 recipe_import 匯入候選 Recipe；核准後會從下一輪模型請求起生效。

# Agent 开始浏览网页后，可在这里观看或接管页面。
source: Once Agent starts browsing the web, you can watch or take over the page here.
ja: Agent がウェブページの閲覧を開始すると、ここでページを表示したり操作を引き継いだりできます。
ko: Agent가 웹을 탐색하기 시작하면 여기에서 페이지를 보거나 인계받을 수 있습니다.
ru: После того как Agent начнёт просматривать веб-страницы, здесь можно будет наблюдать за ним или перехватить управление страницей.
zh_hans: Agent 开始浏览网页后，可在这里观看或接管页面。
zh_hant: Agent 開始瀏覽網頁後，可以在這裡觀看或接管頁面。

# Agent 浏览器任务
source: Agent browser task
ja: Agent のブラウザタスク
ko: Agent 브라우저 작업
ru: Задача браузера Agent
zh_hans: Agent 浏览器任务
zh_hant: Agent 瀏覽器任務

# Agent 网络搜索
source: Agent web search
ja: Agentウェブ検索
ko: Agent 웹 검색
ru: Веб-поиск Agent
zh_hans: Agent 网络搜索
zh_hant: Agent 網路搜尋

# Amber 代笔中
source: Amber is ghostwriting
ja: Amber が代筆中
ko: Amber 대필 중
ru: Amber пишет
zh_hans: Amber 代笔中
zh_hant: Amber 代筆中

# Amber 后台生成
source: Amber background generation
ja: Amber がバックグラウンドで生成中
ko: Amber 백그라운드 생성
ru: Фоновая генерация Amber
zh_hans: Amber 后台生成
zh_hant: Amber 背景產生

# Amber 小说创作中
source: Amber is writing a novel
ja: Amber が小説を執筆中
ko: Amber 소설 작성 중
ru: Amber пишет роман
zh_hans: Amber 小说创作中
zh_hant: Amber 小說創作中

# Amber 正在生成
source: Amber is generating
ja: Amber が生成中
ko: Amber 생성 중
ru: Amber генерирует
zh_hans: Amber 正在生成
zh_hant: Amber 正在產生

# Amber 正在生成图片
source: Amber is generating an image
ja: Amber が画像を生成中
ko: Amber 이미지 생성 중
ru: Amber создаёт изображение
zh_hans: Amber 正在生成图片
zh_hant: Amber 正在產生圖片

# Amber 的核心指令
source: Amber core instructions
ja: Amberのコア指示
ko: Amber 핵심 명령
ru: Основные инструкции Amber
zh_hans: Amber 的核心指令
zh_hant: Amber 的核心指令

# Amber 议会准备中
source: Amber Council preparing
ja: Amber 議会の準備中
ko: Amber 의회 준비 중
ru: Amber готовит совет
zh_hans: Amber 议会准备中
zh_hant: Amber 議會準備中

# Amber 议会讨论中
source: Amber Council in discussion
ja: Amber 議会で議論中
ko: Amber 의회 토론 중
ru: Amber обсуждает в совете
zh_hans: Amber 议会讨论中
zh_hant: Amber 議會討論中

# Antigravity 是 Google 的 Gemini 产品。登录后无需 API Key，即可在聊天里调用 Gemini 模型。
source: Antigravity is a Google Gemini product. After signing in, you can call Gemini models in chat without an API Key.
ja: Antigravity は Google の Gemini 製品です。ログイン後は API Key なしで、チャットから Gemini モデルを利用できます。
ko: Antigravity는 Google의 Gemini 제품입니다. 로그인하면 API Key 없이 채팅에서 Gemini 모델을 호출할 수 있습니다.
ru: Antigravity — продукт Google для Gemini. После входа можно вызывать модели Gemini в чате без API Key.
zh_hans: Antigravity 是 Google 的 Gemini 产品。登录后无需 API Key，即可在聊天里调用 Gemini 模型。
zh_hant: Antigravity 是 Google 的 Gemini 產品。登入後無需 API Key，即可在聊天中呼叫 Gemini 模型。

# Antigravity 登录
source: Antigravity sign-in
ja: Antigravityログイン
ko: Antigravity 로그인
ru: Вход в Antigravity
zh_hans: Antigravity 登录
zh_hant: Antigravity 登入

# Antigravity 登录 (Gemini)
source: Antigravity sign-in (Gemini)
ja: Antigravityログイン（Gemini）
ko: Antigravity 로그인 (Gemini)
ru: Вход в Antigravity (Gemini)
zh_hans: Antigravity 登录（Gemini）
zh_hant: Antigravity 登入 (Gemini)

source: App restarted while waiting for confirmation.
ja: 確認待ちの間に App が再起動しました。
ko: 확인 대기 중 App이 재시작되었습니다.
ru: Приложение перезапущено во время ожидания подтверждения.
zh_hant: 等待確認時 App 已重新啟動。

# App 在工具执行期间中断，无法判断操作是否已经生效。请选择实际结果；系统不会自动重试。
source: The app was interrupted while a tool was running, so it can't determine whether the action took effect. Choose the actual result; the system won't retry automatically.
ja: ツール実行中にアプリが中断され、操作が反映されたか確認できません。実際の結果を選択してください。自動再試行は行いません。
ko: 도구 실행 중 앱이 중단되어 작업이 적용되었는지 확인할 수 없습니다. 실제 결과를 선택하세요. 시스템에서 자동으로 다시 시도하지 않습니다.
ru: Приложение прервалось во время выполнения инструмента и не может определить, применилось ли действие. Выберите фактический результат; автоматического повтора не будет.
zh_hans: 应用在工具执行期间中断，无法判断操作是否已经生效。请选择实际结果；系统不会自动重试。
zh_hant: App 在工具執行期間中斷，無法判斷操作是否已生效。請選擇實際結果；系統不會自動重試。

source: Artifacts
ja: アーティファクト

source: Chat
ja: チャット
ru: Чат
zh_hans: 聊天
zh_hant: 聊天

# ChatGPT 登录 (Codex)
source: ChatGPT sign-in (Codex)
ja: ChatGPTログイン（Codex）
ko: ChatGPT 로그인 (Codex)
ru: Вход в ChatGPT (Codex)
zh_hans: ChatGPT 登录（Codex）
zh_hant: ChatGPT 登入 (Codex)

# Codex 登录
source: Codex sign-in
ja: Codexログイン
ko: Codex 로그인
ru: Вход в Codex
zh_hans: Codex 登录
zh_hant: Codex 登入

# ExperimentalGPL · 本机 /workspace
source: ExperimentalGPL · local /workspace
ja: ExperimentalGPL · ローカル /workspace
ko: ExperimentalGPL · 로컬 /workspace
ru: ExperimentalGPL · локальный /workspace
zh_hans: ExperimentalGPL · 本机 /workspace
zh_hant: ExperimentalGPL · 本機 /workspace

# Fork 剧情
source: Fork story
ja: ストーリーをFork
ko: 스토리 Fork
ru: Fork сюжета
zh_hans: Fork 剧情
zh_hant: Fork 劇情

# Fork 未完成
source: Fork unfinished
ja: 未完了のFork
ko: Fork 미완료
ru: Fork незавершённого
zh_hans: Fork 未完成
zh_hant: Fork 未完成

# Gemini 套餐：%@
source: Gemini plan: %@
ja: Gemini プラン：%@
ko: Gemini 요금제: %@
ru: План Gemini: %@
zh_hans: Gemini 套餐：%@
zh_hant: Gemini 方案：%@

source: Generation failed before the tool call completed.
ja: ツール呼び出しの完了前に生成に失敗しました。
ko: 도구 호출이 완료되기 전에 생성에 실패했습니다.
ru: Генерация завершилась ошибкой до окончания вызова инструмента.
zh_hant: 工具呼叫完成前，產生失敗。

source: Generation interrupted by the system.
ja: システムにより生成が中断されました。
ko: 시스템에 의해 생성이 중단되었습니다.
ru: Генерация прервана системой.
zh_hant: 產生已被系統中斷。

# Grok 登录
source: Grok sign-in
ja: Grokログイン
ko: Grok 로그인
ru: Вход в Grok
zh_hans: Grok 登录
zh_hant: Grok 登入

# HTML 校验通过，已加载到 WKWebView。
source: HTML validation passed and loaded into WKWebView.
ja: HTML の検証に成功し、WKWebView に読み込みました。
ko: HTML 검증을 통과했으며 WKWebView에 로드되었습니다.
ru: Проверка HTML пройдена, HTML загружен в WKWebView.
zh_hans: HTML 校验通过，已加载到 WKWebView。
zh_hant: HTML 驗證通過，已載入 WKWebView。

# HTML 源码
source: HTML source code
ja: HTML ソースコード
ko: HTML 소스 코드
ru: Исходный код HTML
zh_hans: HTML 源码
zh_hant: HTML 原始碼

source: Header
ja: ヘッダー
ko: 헤더
ru: Заголовок
zh_hans: 请求头
zh_hant: 標頭

source: Headers
ja: ヘッダー
ko: 헤더
ru: Заголовки
zh_hans: 请求头
zh_hant: 標頭

# Host 指纹信任
source: Host fingerprint trust
ja: Hostフィンガープリントの信頼
ko: Host 지문 신뢰
ru: Доверие к отпечатку Host
zh_hans: Host 指纹信任
zh_hant: Host 指紋信任

# JSON 配方（颜色与风格槽）。导入会加入主题库；不含图片资源；不改浅深模式与聊天字体。
source: JSON recipe (color and style slots). Importing adds it to the theme library; it includes no image assets and does not change light/dark mode or chat font.
ja: JSON レシピ（カラーとスタイルのスロット）。インポートするとテーマライブラリに追加されます。画像リソースは含まれず、ライト／ダークモードやチャットフォントは変更しません。
ko: JSON 레시피(색상 및 스타일 슬롯). 가져오면 테마 라이브러리에 추가되며 이미지 리소스는 포함되지 않습니다. 라이트/다크 모드와 채팅 글꼴은 변경하지 않습니다.
ru: JSON-рецепт (слоты цвета и стиля). Импорт добавит его в библиотеку тем; изображения не входят; светлая/тёмная тема и шрифт чата не изменятся.
zh_hans: JSON 配方（颜色与风格槽）。导入会加入主题库；不含图片资源；不改浅深模式与聊天字体。
zh_hant: JSON 配方（色彩與風格插槽）。匯入後會加入主題庫；不含圖片資源；不會變更淺色與深色模式及聊天字型。

source: License: %@
ja: ライセンス: %@
ko: 라이선스: %@
ru: Лицензия: %@
zh_hans: 许可证：%@

source: Local iOS tool executor is unavailable.
ja: ローカル iOS ツール実行環境は利用できません。
ko: 로컬 iOS 도구 실행기를 사용할 수 없습니다.
ru: Локальный исполнитель инструментов iOS недоступен.
zh_hant: 本機 iOS 工具執行器無法使用。

# Lorebook（世界书）
source: Lorebook (Worldbook)
ja: Lorebook（ワールドブック）
ko: Lorebook(월드북)
ru: Lorebook (мировая книга)
zh_hans: Lorebook（世界书）
zh_hant: Lorebook（世界書）

# MCP %@ · 已配置 %lld 个后端工具
source: MCP %1$@ · %2$lld backend tools configured
ja: MCP %1$@ · %2$lld 個のバックエンドツールを設定済み
ko: MCP %1$@ · 백엔드 도구 %2$lld개 구성됨
ru: MCP %1$@ · настроено инструментов: %2$lld
zh_hans: MCP %1$@ · 已配置 %2$lld 个后端工具
zh_hant: MCP %1$@ · 已設定 %2$lld 個後端工具

# MCP 服务器
source: MCP server
ja: MCP サーバー
ko: MCP 서버
ru: MCP-сервер
zh_hans: MCP 服务器
zh_hant: MCP 伺服器

# MCP 服务器 %@
source: MCP server %@
ja: MCPサーバー %@
ko: MCP 서버 %@
ru: Сервер MCP %@
zh_hans: MCP 服务器 %@
zh_hant: MCP 伺服器 %@

# MiniApp 创建内容卡片失败：%@
source: MiniApp failed to create content card: %@
ja: MiniApp のコンテンツカード作成に失敗しました：%@
ko: MiniApp 콘텐츠 카드 생성 실패: %@
ru: Не удалось создать карточку контента в MiniApp: %@
zh_hans: MiniApp 创建内容卡片失败：%@
zh_hant: MiniApp 建立內容卡片失敗：%@

# MiniApp 已创建内容卡片：%@
source: MiniApp created content card: %@
ja: MiniApp がコンテンツカードを作成しました：%@
ko: MiniApp 콘텐츠 카드 생성됨: %@
ru: MiniApp создал карточку контента: %@
zh_hans: MiniApp 已创建内容卡片：%@
zh_hant: MiniApp 已建立內容卡片：%@

# POV 可见要点（每行一条）
source: POV highlights (one per line)
ja: POV から見える要点（1行に1つ）
ko: POV에 표시할 핵심 사항(한 줄에 하나씩)
ru: Видимые пункты POV (по одному в строке)
zh_hans: POV 可见要点（每行一条）
zh_hant: POV 可見要點（每行一項）

source: Password
ja: パスワード
ko: 비밀번호
ru: Пароль
zh_hans: 密码
zh_hant: 密碼

source: Path
ja: パス
ko: 경로
ru: Путь
zh_hans: 路径
zh_hant: 路徑

# Reasoning 未启用
source: Reasoning not enabled
ja: Reasoning は無効です
ko: Reasoning 사용 안 함
ru: Reasoning не включён
zh_hans: 推理未启用
zh_hant: Reasoning 未啟用

# Recipe 是声明式工具组合：模型通过 tool_search 发现 recipe__<名称> 并调用；导入/回退都在「下一模型轮」生效。
source: A Recipe is a declarative tool composition: the model discovers and calls recipe__<name> via tool_search; imports and rollbacks take effect from the next model turn.
ja: Recipe は宣言型のツール構成です。モデルは tool_search で recipe__<名前> を見つけて呼び出します。インポート／ロールバックは「次のモデルラウンド」から有効になります。
ko: Recipe는 선언형 도구 조합입니다. 모델은 tool_search로 recipe__<이름>을 찾아 호출합니다. 가져오기/되돌리기는 모두 「다음 모델 라운드」부터 적용됩니다.
ru: Recipe — это декларативная комбинация инструментов: модель находит и вызывает recipe__<name> через tool_search; импорт и откат вступают в силу со следующего раунда модели.
zh_hans: Recipe 是声明式工具组合：模型通过 tool_search 发现 recipe__<名称> 并调用；导入/回退都在「下一模型轮」生效。
zh_hant: Recipe 是宣告式工具組合：模型透過 tool_search 找到 recipe__<名稱> 並呼叫；匯入／復原都會從「下一輪模型請求」起生效。

# Recipe 详情
source: Recipe details
ja: Recipe の詳細
ko: Recipe 세부 정보
ru: Подробности Recipe
zh_hans: Recipe 详情
zh_hant: Recipe 詳情

# Remote SSH 配置
source: Remote SSH configuration
ja: Remote SSH設定
ko: Remote SSH 구성
ru: Настройки Remote SSH
zh_hans: Remote SSH 配置
zh_hant: Remote SSH 設定

source: Replay unavailable
ja: リプレイを利用できません
ko: 재생할 수 없음
ru: Повтор недоступен
zh_hans: 无法回放
zh_hant: 無法重播

source: Settings
ja: 設定
ko: 설정
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# Skill %@ · %lld 个服务
source: Skill %1$@ · %2$lld services
ja: Skill %1$@ · %2$lld 個のサービス
ko: 스킬 %1$@ · 서비스 %2$lld개
ru: Skill %1$@ · сервисов: %2$lld
zh_hans: Skill %1$@ · %2$lld 个服务
zh_hant: Skill %1$@ · %2$lld 個服務

source: Smoke Test verifies the current default Runtime: Remote SSH runs echo amber-terminal-smoke, while local tools and iSH run pwd. iSH's /workspace is inside the built-in rootfs and isolated from the Amber chat workspace and Remote SSH cwd; it is not synced automatically.
ja: Smoke Test は現在のデフォルト Runtime を検証します。Remote SSH では echo amber-terminal-smoke、ローカルツールと iSH では pwd を実行します。iSH の /workspace は内蔵 rootfs 上にあり、Amber チャットの workspace や Remote SSH の cwd とは分離されています。自動同期は行いません。
ko: Smoke Test는 현재 기본 Runtime을 확인합니다. Remote SSH에서는 echo amber-terminal-smoke를 실행하고, 로컬 도구와 iSH에서는 pwd를 실행합니다. iSH의 /workspace는 내장 rootfs에 있으며 Amber 채팅 workspace 및 Remote SSH cwd와 격리되어 자동으로 동기화되지 않습니다.
ru: Smoke Test проверяет Runtime по умолчанию: Remote SSH выполняет echo amber-terminal-smoke, локальные инструменты и iSH — pwd. /workspace iSH находится во встроенном rootfs и изолирован от workspace чата Amber и cwd Remote SSH; автосинхронизации нет.
zh_hans: Smoke Test 会验证当前默认 Runtime：Remote SSH 执行 echo amber-terminal-smoke，本地工具与 iSH 执行 pwd。iSH 的 /workspace 位于内置 rootfs，与 Amber 聊天 workspace、Remote SSH cwd 隔离，不会自动同步。
zh_hant: Smoke Test 會驗證目前的預設 Runtime：Remote SSH 執行 echo amber-terminal-smoke，本機工具與 iSH 執行 pwd。iSH 的 /workspace 位於內建 rootfs，與 Amber 聊天 workspace、Remote SSH cwd 隔離，不會自動同步。

source: Terminal tool output cannot be attached to a chat message.
ja: Terminal ツールの出力はチャットメッセージに添付できません。
ko: Terminal 도구 출력은 채팅 메시지에 첨부할 수 없습니다.
ru: Вывод инструмента Terminal нельзя прикрепить к сообщению чата.
zh_hant: Terminal 工具輸出無法附加至聊天訊息。

source: The model output ended before the tool call completed.
ja: ツール呼び出し完了前にモデル出力が終了しました。
ko: 도구 호출이 완료되기 전에 모델 출력이 끝났습니다.
ru: Вывод модели завершился до окончания вызова инструмента.
zh_hant: 工具呼叫完成前，模型輸出已結束。

source: The previous generation ended before the tool call completed.
ja: ツール呼び出しが完了する前に、前回の生成が終了しました。
ko: 도구 호출이 완료되기 전에 이전 생성이 종료되었습니다.
ru: Предыдущая генерация завершилась до завершения вызова инструмента.
zh_hans: 上一次生成在工具调用完成前已结束。
zh_hant: 上一次產生在工具呼叫完成前就結束了。

source: The tool was unavailable during background continuation.
ja: バックグラウンド継続中はツールを利用できませんでした。
ko: 백그라운드 계속 실행 중 도구를 사용할 수 없었습니다.
ru: Инструмент недоступен при продолжении в фоне.
zh_hant: 背景繼續執行期間，工具無法使用。

source: Unable to persist the required visual retry checkpoint.
ja: 必要な視覚的再試行チェックポイントを保存できませんでした。
ko: 필요한 시각적 재시도 체크포인트를 저장하지 못했습니다.
ru: Не удалось сохранить обязательную контрольную точку повтора распознавания.
zh_hant: 無法儲存必要的視覺重試檢查點。

source: User cancelled.
ja: ユーザーがキャンセルしました。
ko: 사용자가 취소했습니다.
ru: Отменено пользователем.
zh_hant: 使用者已取消。

source: Username
ja: ユーザー名
ko: 사용자 이름
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

source: Value
ja: 値
ko: 값
ru: Значение
zh_hans: 值
zh_hant: 值

source: WebDAV Base URL
ja: WebDAVベースURL
ko: WebDAV 기본 URL
ru: Базовый URL WebDAV
zh_hans: WebDAV 基础 URL
zh_hant: WebDAV 基底 URL

source: WebMount tool output cannot be attached to a chat message.
ja: WebMount ツールの出力はチャットメッセージに添付できません。
ko: WebMount 도구 출력은 채팅 메시지에 첨부할 수 없습니다.
ru: Вывод инструмента WebMount нельзя прикрепить к сообщению чата.
zh_hans: 站点工具输出无法附加到聊天消息。
zh_hant: 站點工具輸出無法附加至聊天訊息。

source: Workspace tool output cannot be attached to a chat message.
ja: Workspace ツールの出力はチャットメッセージに添付できません。
ko: Workspace 도구 출력은 채팅 메시지에 첨부할 수 없습니다.
ru: Вывод инструмента Workspace нельзя прикрепить к сообщению чата.
zh_hant: Workspace 工具輸出無法附加至聊天訊息。

# Workspace 保存失败，请稍后重试。
source: Workspace save failed. Please try again.
ja: Workspace の保存に失敗しました。後でもう一度お試しください。
ko: Workspace 저장 실패. 나중에 다시 시도하세요.
ru: Не удалось сохранить в Workspace. Повторите позже.
zh_hans: Workspace 保存失败，请稍后重试。
zh_hant: Workspace 儲存失敗，請稍後重試。

# Workspace 同步失败
source: Workspace sync failed
ja: Workspace の同期に失敗しました
ko: Workspace 동기화 실패
ru: Синхронизация Workspace не удалась
zh_hans: Workspace 同步失败
zh_hant: Workspace 同步失敗

# Workspace 同步失败：%@
source: Workspace sync failed: %@
ja: Workspace の同期に失敗しました：%@
ko: Workspace 동기화 실패: %@
ru: Ошибка синхронизации Workspace: %@
zh_hans: Workspace 同步失败：%@
zh_hant: Workspace 同步失敗：%@

# iOS 当前使用系统语音合成。云端 TTS 配置会保留，但暂不参与试听或聊天朗读。
source: iOS currently uses system speech synthesis. Cloud TTS configuration is retained but isn't used for previews or chat read-aloud.
ja: iOS では現在、システム音声合成を使用しています。クラウド TTS の設定は保持されますが、試聴やチャットの読み上げにはまだ使用されません。
ko: iOS는 현재 시스템 음성 합성을 사용합니다. 클라우드 TTS 설정은 유지되지만 미리 듣기나 채팅 낭독에 사용되지 않습니다.
ru: Сейчас iOS использует системный синтез речи. Настройки облачного TTS сохраняются, но пока не используются для прослушивания или озвучивания чата.
zh_hans: iOS 当前使用系统语音合成。云端 TTS 配置会保留，但暂不参与试听或聊天朗读。
zh_hant: iOS 目前使用系統語音合成。雲端 TTS 設定會保留，但暫不參與試聽或聊天朗讀。

# iOS 当前只提供系统与衬线两种真实可用字体，不显示未打包字体包。
source: iOS currently offers only the system and serif fonts that are actually available; unbundled font packs are hidden.
ja: iOS では現在、実際に利用できるフォントはシステムとセリフ体の2種類のみです。パッケージ化されていないフォントは表示しません。
ko: iOS에서는 현재 시스템 글꼴과 세리프 글꼴만 실제 사용 가능한 글꼴로 제공하며, 패키징되지 않은 글꼴 패키지는 표시하지 않습니다.
ru: Сейчас iOS предоставляет только два реально доступных шрифта: системный и с засечками; неупакованные пакеты шрифтов не показываются.
zh_hans: iOS 当前只提供系统与衬线两种真实可用字体，不显示未打包字体包。
zh_hant: iOS 目前只提供系統與襯線兩種實際可用字型，不顯示未封裝的字型套件。

# iPhone 响应超时，请重试
source: iPhone timed out. Please try again.
ja: iPhone の応答がタイムアウトしました。もう一度お試しください
ko: iPhone 응답 시간이 초과되었습니다. 다시 시도하세요.
ru: Превышено время ожидания ответа iPhone, повторите попытку
zh_hans: iPhone 响应超时，请重试
zh_hant: iPhone 回應逾時，請重試

# iPhone 当前无法处理手表操作
source: iPhone can't handle the watch action right now.
ja: iPhone では現在、ウォッチの操作を処理できません
ko: iPhone에서 워치 작업을 처리할 수 없습니다.
ru: iPhone сейчас не может обработать операцию с часами
zh_hans: iPhone 当前无法处理手表操作
zh_hant: iPhone 目前無法處理手錶操作

# iPhone 聊天状态不可用
source: iPhone chat state unavailable
ja: iPhone のチャット状態を利用できません
ko: iPhone 채팅 상태를 사용할 수 없습니다.
ru: Состояние чата на iPhone недоступно
zh_hans: iPhone 聊天状态不可用
zh_hant: iPhone 聊天狀態無法使用

# iSH 交互终端
source: iSH interactive terminal
ja: iSH インタラクティブターミナル
ko: iSH 대화형 터미널
ru: Интерактивный терминал iSH
zh_hans: iSH 交互终端
zh_hant: iSH 互動終端機

# language.back_to_settings
source: Back to Settings
ja: 設定に戻る
ko: 설정으로 돌아가기
ru: Назад к настройкам
zh_hans: 返回设置
zh_hant: 返回設定

# language.change_applies
source: Changes apply immediately and remain after restart.
ja: 変更はすぐに反映され、再起動後も保持されます。
ko: 변경 사항은 즉시 적용되며 앱을 다시 시작해도 유지됩니다.
ru: Изменения применяются сразу и сохраняются после перезапуска.
zh_hans: 更改会立即生效，并在重新启动后保留。
zh_hant: 變更會立即生效，並在重新啟動後保留。

# language.follow_system
source: Follow System
ja: システム設定に従う
ko: 시스템 설정 따르기
ru: Как в системе
zh_hans: 跟随系统
zh_hant: 跟隨系統

# language.follow_system_detail
source: Uses the first supported language in your system preferences.
ja: システム設定で最初に選ばれている対応言語を使用します。
ko: 시스템 설정에서 지원되는 첫 번째 언어를 사용합니다.
ru: Используется первый поддерживаемый язык из системных настроек.
zh_hans: 使用系统偏好设置中排在最前的受支持语言。
zh_hant: 使用系統偏好設定中最前面的支援語言。

# language.section
source: Application Language
ja: アプリの言語
ko: 앱 언어
ru: Язык приложения
zh_hans: 应用语言
zh_hant: 應用程式語言

# language.selected
source: Selected
ja: 選択中
ko: 선택됨
ru: Выбрано
zh_hans: 已选择
zh_hant: 已選取

# language.title
source: Language
ja: 言語
ko: 언어
ru: Язык
zh_hans: 语言
zh_hant: 語言

source: permissions_status cannot be attached to a chat message.
ja: permissions_status はチャットメッセージに添付できません。
ko: permissions_status는 채팅 메시지에 첨부할 수 없습니다.
ru: permissions_status нельзя прикрепить к сообщению чата.
zh_hant: permissions_status 無法附加至聊天訊息。

# tool result ledger write failed
source: Failed to write the tool result ledger.
ja: ツール結果台帳の書き込みに失敗しました
ko: tool result ledger 기록에 실패했습니다.
ru: Не удалось записать журнал результатов инструмента
zh_hans: tool result ledger write failed
zh_hant: 工具結果帳本寫入失敗

# v%lld · %@ · %lld 次运行
source: v%1$lld · %2$@ · %3$lld runs
ja: v%1$lld · %2$@ · %3$lld 回の実行
ko: v%1$lld · %2$@ · %3$lld회 실행
ru: v%1$lld · %2$@ · запусков: %3$lld
zh_hans: v%1$lld · %2$@ · %3$lld 次运行
zh_hant: v%1$lld · %2$@ · %3$lld 次執行

# 「%@」想%@： %@
source: “%@” wants to %@: %@
ja: 「%@」が%@を希望しています： %@
ko: 「%@」이(가) %@하려고 합니다: %@
ru: «%@» запрашивает %@: %@
zh_hans: 「%@」想%@： %@
zh_hant: 「%@」想%@： %@

# 「%@」想打开小应用 %@。
source: “%@” wants to open MiniApp %@.
ja: 「%@」がミニアプリ %@ を開こうとしています。
ko: 「%@」이(가) MiniApp %@을(를) 열려고 합니다.
ru: «%@» хочет открыть мини-приложение %@.
zh_hans: 「%@」想打开小应用 %@。
zh_hant: 「%@」想開啟小應用 %@。

# 「%@」想订阅 %@ 传感器。
source: “%@” wants to subscribe to the %@ sensor.
ja: 「%@」が%@センサーの購読を希望しています。
ko: 「%@」이(가) %@ 센서를 구독하려고 합니다.
ru: «%@» хочет подписаться на датчик %@.
zh_hans: 「%@」想订阅 %@ 传感器。
zh_hant: 「%@」想訂閱 %@ 感測器。

# 「%@」想读取 %@ 位置。
source: “%@” wants to read the %@ location.
ja: 「%@」が%@の位置情報を読み取ろうとしています。
ko: 「%@」이(가) %@ 위치를 읽으려고 합니다.
ru: «%@» хочет прочитать местоположение %@.
zh_hans: 「%@」想读取 %@ 位置。
zh_hant: 「%@」想讀取 %@ 位置。

# 「%@」想读取当前剪贴板文本。
source: “%@” wants to read the current clipboard text.
ja: 「%@」が現在のクリップボードのテキストを読み取ろうとしています。
ko: 「%@」이(가) 현재 클립보드 텍스트를 읽으려고 합니다.
ru: «%@» хочет прочитать текущий текст из буфера обмена.
zh_hans: 「%@」想读取当前剪贴板文本。
zh_hant: 「%@」想讀取目前剪貼簿文字。

# 「%@」想读取最小化会话上下文，最多 %lld 字。完整聊天记录、系统提示词、provider 设置、凭证和隐藏工具输出不会暴露。
source: “%@” wants to read minimal session context, up to %lld characters. Full chat history, system prompts, provider settings, credentials, and hidden tool output are not exposed.
ja: 「%@」が最小限のセッションコンテキスト（最大%lld文字）の読み取りを希望しています。完全なチャット履歴、システムプロンプト、provider設定、認証情報、非表示のツール出力は公開されません。
ko: 「%@」이(가) 최소화된 세션 컨텍스트를 읽으려고 합니다(최대 %lld자). 전체 채팅 기록, 시스템 프롬프트, provider 설정, 자격 증명 및 숨겨진 도구 출력은 노출되지 않습니다.
ru: «%@» хочет прочитать минимальный контекст сеанса (до %lld символов). Полная история чата, системные подсказки, настройки provider, учётные данные и скрытый вывод инструментов не будут раскрыты.
zh_hans: 「%@」想读取最小化会话上下文，最多 %lld 字。完整聊天记录、系统提示词、provider 设置、凭证和隐藏工具输出不会暴露。
zh_hant: 「%@」想讀取最小化工作階段上下文，最多 %lld 字。完整聊天記錄、系統提示詞、provider 設定、憑證和隱藏工具輸出不會暴露。
